Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/MediaConf/GetStreamUri/TC.MC.NVT.29_REQ_01.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <GetStreamUri xmlns="http://www.onvif.org/ver10/media/wsdl">
      <StreamSetup>
        <!-- Attribute Wild card could not be matched. Generated XML may not be valid. -->
        <Stream xmlns="http://www.onvif.org/ver10/schema">RTP-Unicast</Stream>
        <Transport xmlns="http://www.onvif.org/ver10/schema">
          <Protocol>UDP</Protocol>
        </Transport>
      </StreamSetup>
      <ProfileToken>fixed_prof0</ProfileToken>
    </GetStreamUri>
  </soap:Body>
</soap:Envelope>