References/ASTT/TestSuits/Tests/MediaConf/TC.MC.NVT.24/TC.MC.NVT.24_REQ_10.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trt:SetVideoEncoderConfiguration>
      <trt:Configuration token="encoder1">
        <tt:Name>TestName2</tt:Name>
        <tt:UseCount>1</tt:UseCount>
        <tt:Encoding>JPEG</tt:Encoding>
        <tt:Resolution>
          <tt:Width>352</tt:Width>
          <tt:Height>288</tt:Height>
        </tt:Resolution>
        <tt:Quality>7000</tt:Quality>
        <tt:MPEG4>
          <tt:GovLength>15</tt:GovLength>
          <tt:Mpeg4Profile>ASP</tt:Mpeg4Profile>
        </tt:MPEG4>
        <tt:Multicast>
          <tt:Address>
            <tt:Type>IPv4</tt:Type>
            <tt:IPv4Address>254.255.255.255</tt:IPv4Address>
          </tt:Address>
          <tt:Port>7999</tt:Port>
          <tt:TTL>3</tt:TTL>
          <tt:AutoStart>false</tt:AutoStart>
        </tt:Multicast>
        <tt:SessionTimeout>PT2H</tt:SessionTimeout>
      </trt:Configuration>
      <trt:ForcePersistence>true</trt:ForcePersistence>
    </trt:SetVideoEncoderConfiguration>
  </soap:Body>
</soap:Envelope>