References/ASTT/TestSuits/Tests/MediaConf/TC.MC.NVT.21/TC.MC.NVT.21_REQ_02.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trt:GetVideoEncoderConfigurationOptions>
      <trt:ConfigurationToken>encoder1</trt:ConfigurationToken>
    </trt:GetVideoEncoderConfigurationOptions>
</soap:Body>
</soap:Envelope>