nxvpro/Resources/soap_set_video_encoder.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <SetVideoEncoderConfiguration xmlns="http://www.onvif.org/ver10/media/wsdl">
            <Configuration token="_ENCODER_TOKEN_">
                <Name xmlns="http://www.onvif.org/ver10/schema">_VIDEO_CONFIG_TOKEN_</Name>
                <UseCount xmlns="http://www.onvif.org/ver10/schema">_USER_COUNT_</UseCount>
                <Encoding xmlns="http://www.onvif.org/ver10/schema">H264</Encoding>
                <Resolution xmlns="http://www.onvif.org/ver10/schema">
                    <Width>_RES_WIDTH_</Width>
                    <Height>_RES_HEIGHT_</Height>
                </Resolution>
                <Quality xmlns="http://www.onvif.org/ver10/schema">_QUALITY_</Quality>
                <RateControl xmlns="http://www.onvif.org/ver10/schema">
                    <FrameRateLimit>_FPS_</FrameRateLimit>
                    <EncodingInterval>_INTERVAL_</EncodingInterval>
                    <BitrateLimit>_BITRATE_</BitrateLimit>
                </RateControl>
                <H264 xmlns="http://www.onvif.org/ver10/schema">
                    <GovLength>_GOVLEN_</GovLength>
                    <H264Profile>_H264_PROFILE_</H264Profile>
                </H264>
                <Multicast xmlns="http://www.onvif.org/ver10/schema">
                    <Address>
                        <Type>_IPA_TYPE_</Type>
                        <_IPA_TYPE_Address>_IP_ADDR_</_IPA_TYPE_Address>
                    </Address>
                    <Port>_PORT_</Port>
                    <TTL>_TTL_</TTL>
                    <AutoStart>_AUTOSTART_</AutoStart>
                </Multicast>
                <SessionTimeout xmlns="http://www.onvif.org/ver10/schema">_TIMEOUT_</SessionTimeout>
            </Configuration>
            <ForcePersistence>true</ForcePersistence>
        </SetVideoEncoderConfiguration>
    </s:Body>
</s:Envelope>
