tests/Media_GetVideoEncoderConfigurationOptions.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:xmime="http://tempuri.org/xmime.xsd" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:wsnb="http://docs.oasis-open.org/wsn/b-2" xmlns:ns1="http://www.w3.org/2004/08/xop/include" xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2" xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" xmlns:tds="http://www.onvif.org/ver10/media/wsdl">
	<SOAP-ENV:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" SOAP-ENC:mustUnderstand="true">
                        <wsse:UsernameToken wsu:Id="UsernameToken-14">
                                <wsse:Username>root</wsse:Username>
                                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">FyjTaK5w90bDNRb5hzWwoaYpX5M=</wsse:Password>
                                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">VNAN0Nuy6gsm6YwAZh8HwA==</wsse:Nonce>
                                <wsu:Created>2013-02-19T15:16:46.862Z</wsu:Created>
                        </wsse:UsernameToken>
                </wsse:Security>		
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
	<tds:GetVideoEncoderConfigurationOptions/>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
