windows/Resources/ws_get_stream_uri.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
    xmlns:tt="http://www.onvif.org/ver10/schema">
    <soap:Body>
        <trt:GetStreamUri>
            <trt:StreamSetup>
                <trt:Stream>RTP-Unicast</trt:Stream>
                <tt:Transport>
                    <tt:Protocol>RTSP</tt:Protocol>
                </tt:Transport>
            </trt:StreamSetup>
            <trt:ProfileToken>{0:s}</trt:ProfileToken>
        </trt:GetStreamUri>
    </soap:Body>
</soap:Envelope>
