onvif/SetVideoEncoderConf.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header>%s</s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><SetVideoEncoderConfiguration xmlns="http://www.onvif.org/ver10/media/wsdl"><Configuration token="%s"><Name xmlns="http://www.onvif.org/ver10/schema">%s</Name><UseCount xmlns="http://www.onvif.org/ver10/schema">1</UseCount><Encoding xmlns="http://www.onvif.org/ver10/schema">H264</Encoding><Resolution xmlns="http://www.onvif.org/ver10/schema"><Width>%d</Width><Height>%d</Height></Resolution><Quality xmlns="http://www.onvif.org/ver10/schema">%d</Quality><RateControl xmlns="http://www.onvif.org/ver10/schema"><FrameRateLimit>%d</FrameRateLimit><EncodingInterval>%d</EncodingInterval><BitrateLimit>%d</BitrateLimit></RateControl><H264 xmlns="http://www.onvif.org/ver10/schema"><GovLength>%d</GovLength><H264Profile>%s</H264Profile></H264><Multicast xmlns="http://www.onvif.org/ver10/schema"><Address><Type>IPv4</Type><IPv4Address>238.255.255.255</IPv4Address></Address><Port>25320</Port><TTL>60</TTL><AutoStart>false</AutoStart></Multicast><SessionTimeout xmlns="http://www.onvif.org/ver10/schema">PT0S</SessionTimeout></Configuration><ForcePersistence>true</ForcePersistence></SetVideoEncoderConfiguration></s:Body></s:Envelope>