indoor/app/layout/resource/resource/onvif/media_profile.xml

POST /onvif/Media HTTP/1.1
Host: %s
Content-Type: application/soap+xml; charset=utf-8
%sContent-Length: %d

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    %s<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <GetProfiles xmlns="http://www.onvif.org/ver10/media/wsdl" />
    </s:Body>
</s:Envelope>